       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE03.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ITF-FILE ASSIGN TO ITF
           ORGANIZATION SEQUENTIAL.

           SELECT OTF-FILE ASSIGN TO OTF
           ORGANIZATION SEQUENTIAL.

           DATA DIVISION.
           FILE SECTION
           FD ITF-FILE.