       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "SHIBATAMAI"
           STOP RUN.
