       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATE02.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WK-LINE     PIC X(50) VALUE ALL"-".
       01  WK-COUNT    PIC 9(5) VALUE ZERO.
       01  WK-HEADER   PIC X(30) VALUE SPACE.
       01  WK-END-MARK PIC X(10) VALUE HIGH-VALUE.
