       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATE04.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  EMPLOYEE-TABLE.
           03 EMPLOYEE OCCURS 5.
           05 WK-NUMBER PIC 9(6).
           05 WK-NAME PIC X(20).
           
           