       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOP01.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WK-PRICE    PIC 9(8) VALUE 5000.
       01  WK-QTY      PIC 9(4) VALUE 3.
       01  WK-TOTAL    PIC 9(12).

       PROCEDURE DIVISION.
           COMPUTE WK-TOTAL = WK-PRICE * WK-QTY.

           DISPLAY WK-TOTAL.
           STOP RUN.
           