      ******************************************************************
      * Copyright (c) 2026 システム技研株式会社
      * All Rights Reserved.
      *
      * 本ファイルの利用条件は LICENSE.materials に記載されています。
      * The terms and conditions for use of this file are described
      * in LICENSE.materials
      ******************************************************************
      *    KCCMURIAGE : 売上マスタ
      ******************************************************************
       01  CMURIAGE-SHOHIN-NO          PIC  9(05).
       01  CMURIAGE-SHOHIN-MEI         PIC  N(10).
       01  CMURIAGE-URIAGE-YM          PIC  X(06).
       01  CMURIAGE-URIKAKE-ZAN        PIC S9(09).                      *> 未使用
       01  CMURIAGE-URIAGE-GAKU        PIC S9(09).
       01  CMURIAGE-NYUKIN-GAKU        PIC S9(09).                      *> 未使用
